In [48]:
import pandas as pd
import numpy as np 

from sklearn import linear_model

In [49]:
df=pd.read_csv("C:\\Users\\shaurya rakesh\\Downloads\\hiring.csv")
df

   experience  test_score  interview_score  salary
0           0           8                9   50000
1           0           8                6   45000
2           5           6                7   60000
3           2          10               10   65000
4           7           9                6   70000
5           3           7               10   62000
6          10           7                7   72000
7          11           7                8   80000

In [50]:
import math
median_score=math.floor(df.test_score.median())
median_score

7

In [51]:
df.test_score.fillna(median_score)
df

   experience  test_score  interview_score  salary
0           0           8                9   50000
1           0           8                6   45000
2           5           6                7   60000
3           2          10               10   65000
4           7           9                6   70000
5           3           7               10   62000
6          10           7                7   72000
7          11           7                8   80000

In [52]:
df

   experience  test_score  interview_score  salary
0           0           8                9   50000
1           0           8                6   45000
2           5           6                7   60000
3           2          10               10   65000
4           7           9                6   70000
5           3           7               10   62000
6          10           7                7   72000
7          11           7                8   80000

In [65]:
reg=linear_model.LinearRegression()

reg.fit(df[['experience','test_score','interview_score']],df.salary)

reg.predict([[10,0,0]])

C:\Users\shaurya rakesh\anaconda3\Lib\site-packages\sklearn\base.py:464: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([44215.3415969])

In [62]:

reg.predict([[2,9,6]])

AttributeError: 'numpy.ndarray' object has no attribute 'predict'

In [63]:
reg.predict([[12,10,10]])

AttributeError: 'numpy.ndarray' object has no attribute 'predict'